[
    {
        "id": "exp4",
        "title": "AVP under Publicities & Creatives for La Salle Computer Society",
        "contrib": "Initially, my friends and I joined this committee to gain experience, make friends, and learn new things about our college. I joined the publicities and creatives team because I thought that it was in-line with the career that I wanted to pursue in the future. During this time, I've helped plan one activity for LEAP called GitHired, as well as made publication materials for various organization events.",
        "learned": "My course is quite difficult and being part of something that engages with my hobby, even just a little bit, helps me unwind a little even if it does lean slightly towards the corporate realm. Being part of this organization gave me a taste of what a corporate job might feel like. There were more things you had to do besides just creating the poster to be published."
    },
    {
        "id": "exp3",
        "title": "Publicities & Creatives Member for the Student Council",
        "contrib": "When I was in the 12th Grade, the student council created a subcommittee called 'publicities & creatives'. We were in charge of creating publication materials that advertised school events or student council announcements. Though it was made quite late into the semester, I still had lots of fun planning and creating materials with my small group.",
        "learned": "This was my first time creating pieces that were meant for the public. I learned how to polish my work through the help of my two other teammates who were more well-versed in the art sphere."
    },
    {
        "id": "exp2",
        "title": "Writer for Sacre Coeur (School Editorial)",
        "contrib": "I joined the school editorial quite late as well since its applications were close to the end of our academic year. Despite this, I was still able to help edit and revise my peers' works before publishing them online. I also made a piece of my own, but I only ever wrote one article.",
        "learned": "I hadn't been as active in extracurricular activities in my previous years which is why this is my first time experiencing being part of a group outside of my required subjects. Through this, I learned a more juvenile way of corporate work."
    },
    {
        "id": "exp1",
        "title": "Lead for Grade 12 Research Project",
        "contrib": "During the first semester of the 12th grade, I led my group in our research subject where we studied the effectivity of Bagasse (the fibers of a sugarcane) as a sound-absorbing panel. We accomplished many things as a group together and we were often the ones who earned the instructor's praise. I led them through idea generation, creating maps and guidelines, the physical implementation of our product, the testing phase, and the analysis of our results. Through all of this, our bond as a group grew as we shared our wins and losses. There was one time when we had to present our results for the review of related literature part of our study but we did not have anything prepared. We were able to complete a huge part of it and its citations within 20 minutes. It was times like those that I saw how great we were as a group.",
        "learned": "Though I have had many research subjects in the past and have been in charge of most of them, this group was where I learned about leadership and teamwork the most. This was where I first learned how to truly support my fellow teammates and connect with them on a deeper level in order to work better together. It was because of them that I learned how to efficiently organize our project and defend our study confidently in front of our panel."
    }
]